# Pandas and NumPy

## Section 1 - NumPy: Arrays and Matrices

We'll start by importing the packages we'll be using in this section

In [1]:
import numpy as np
import pandas as pd

Create two 1D numpy arrays (`np.array([])` as follows and take one away from the other, do you get the same answer as shown below:

$$
\begin{bmatrix} -1 \\ 12 \\ 14 \\ 2 \end{bmatrix} - \begin{bmatrix} 10 \\ 3 \\ 0 \\ 2\end{bmatrix} = 
\begin{bmatrix} -11 \\ 9 \\ 14 \\ 0\end{bmatrix}
$$

In [2]:
print(np.array([-1, 12, 14, 2]) - np.array([10, 9, 14, 0]))

[-11   3   0   2]

Now try multiplying the first array by a scalar, do you get the following results:

$$
\begin{bmatrix} -1 \\ 12 \\ 14 \\ 2 \end{bmatrix} * 4 = 
\begin{bmatrix} -4 \\ 48 \\ 56 \\ 8\end{bmatrix}
$$

In [3]:
print(np.array([-1, 12, 14, 2]) * 4)

[-4 48 56  8]

Carry out an element-wise multiplication on the following matrices and check you get same answer as below:
$$
\begin{bmatrix} -1 & 2 \\ 3 & -4 \end{bmatrix} * \begin{bmatrix} 13 & 25 \\ 16 & -4 \end{bmatrix} = 
\begin{bmatrix} -13 & 50 \\ 48 & 16\end{bmatrix}
$$

In [4]:
print(np.array([[-1, 2], [3, -4]]) * np.array([[13, 25], [16, -4]]))

[[-13  50]
 [ 48  16]]

Create a 3x3 matrix with numbers of your choice and carry out a dot product (`np.dot(m1, m2)`) with the matrix below:  

$\begin{bmatrix} 2 & 0 & 0 \\ 0 & 2 & 0 \\ 0 & 0 & 2 \end{bmatrix}$  

How does the first matrix relate to the dot product?

In [5]:
print(np.dot(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), np.array([[2, 0, 0], [0, 2, 0], [0, 0, 2]])))

[[ 2  4  6]
 [ 8 10 12]
 [14 16 18]]

Now that we're comfortable with Vectors and Matrices, we'll get started with pandas

## Section 2 - pandas: Series and Data Frames

Series will carry out vector arithmetic aligned on their indices.  

Run the cell below and see how the two Series are added together, not by the order they are in but by their indices.

In [6]:
s1 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([10, 20, 30, 40], index=['c', 'd', 'b', 'a'])
print(s1)
print(s2)
print(s1 + s2)

a    1
b    2
c    3
d    4
dtype: int64
c    10
d    20
b    30
a    40
dtype: int64
a    41
b    32
c    13
d    24
dtype: int64

Have a go at this yourself, create two Series:

* one with the values [5, 10, 15, 20] 
* one with values [0.1, 1, 10, 100]  

and assign the indices such that when you multiply the two Series together, the resulting Series' values are [50, 1000, 1.5, 20].

In [7]:
s1a = pd.Series([5, 10, 15, 20], index=['alpha', 'bravo', 'charlie', 'delta'])
s2a = pd.Series([0.1, 1, 10, 100], index=['charlie', 'delta', 'alpha', 'bravo'])
print(s1a * s2a)

alpha        50.0
bravo      1000.0
charlie       1.5
delta        20.0
dtype: float64

Run the cell below to assign the Series to s3 and print the result

In [8]:
s3_index = ['alpha', 'beta', 'gamma', 'delta', 'epsilon', 'zeta', 'eta', 'theta', 'iota', 'kappa']
s3 = pd.Series([1, 14, 5, 12, 9, 52, 40, 100, 15, 37], index=s3_index)
print(s3)

alpha        1
beta        14
gamma        5
delta       12
epsilon      9
zeta        52
eta         40
theta      100
iota        15
kappa       37
dtype: int64

Using a list of index names, select the values 12, 52, 15 and 37

In [9]:
s3[['delta', 'zeta', 'iota', 'kappa']]

delta    12
zeta     52
iota     15
kappa    37
dtype: int64

Using a list of booleans, select values with the labels `delta`, `epsilon`, `zeta` and `iota`

In [10]:
s3[[False, False, False, True, True, True, False, False, True, False]]

delta      12
epsilon     9
zeta       52
iota       15
dtype: int64

Using a comparison statement, select all the values that are less than 10

In [11]:
s3[s3 < 10]

alpha      1
gamma      5
epsilon    9
dtype: int64

Using another comparison statement, select all values that are greater than the value of `'eta'`

In [12]:
s3[s3 > s3['eta']]

zeta      52
theta    100
dtype: int64

Using another comparison statement, select all the negative values

In [13]:
s3[s3 < 0]

Series([], dtype: int64)

Create your own Series using the notation `pd.Series(<array here>, index=<index here>)` and print your Series

In [14]:
s4 = pd.Series([1, 2, 3, 4, 5, 6, 7, 8], index=['ein', 'zwei', 'drei', 'vier', 'funf', 'sechs', 'sieben', 'acht'])
print(s4)

ein       1
zwei      2
drei      3
vier      4
funf      5
sechs     6
sieben    7
acht      8
dtype: int64

Now construct the same Series using a dict

In [15]:
s4 = pd.Series({
    'ein': 1,
    'zwei': 2,
    'drei': 3,
    'vier': 4,
    'funf': 5,
    'sechs': 6,
    'sieben': 7,
    'acht': 8
})
print(s4)
print('')
print(s4.sort_values())

acht      8
drei      3
ein       1
funf      5
sechs     6
sieben    7
vier      4
zwei      2
dtype: int64

ein       1
zwei      2
drei      3
vier      4
funf      5
sechs     6
sieben    7
acht      8
dtype: int64

#### Manitoba Lakes Data Set
The following data describes the 9 largest lakes in Manitoba, Canada, run this cell to see the Data Frame.

The elevation is given in metres area is given in km<sup>2</sup>.

In [16]:
lakes = pd.DataFrame({
    'elevation': [217, 254, 248, 254, 253, 227, 178, 207, 217],
    'area': [24387, 5374, 4624, 2247, 1353, 1223, 1151, 755, 657]
    }, index=['Winnipeg', 'Winnipegosis', 'Manitoba', 'SouthernIndian', 'Cedar', 'Island', 'Gods', 'Cross', 'Playgreen']
)
print(lakes)

                 area  elevation
Winnipeg        24387        217
Winnipegosis     5374        254
Manitoba         4624        248
SouthernIndian   2247        254
Cedar            1353        253
Island           1223        227
Gods             1151        178
Cross             755        207
Playgreen         657        217

Print the elevation of Cedar Lake

In [17]:
print(lakes.loc['Cedar', 'elevation'])

253

Select the data from the lakes whose area is greater than 1000 but less than 2000 km<sup>2</sup>

In [18]:
print(lakes[(lakes['area'] > 1000) & (lakes['area'] < 2000)])

        area  elevation
Cedar   1353        253
Island  1223        227
Gods    1151        178

How much bigger in km<sup>2</sup> is Lake Manitoba from the area of the Southern Indian Lake, Gods Lake and Cross Lake combined?

In [19]:
diff = (
    lakes.loc['Manitoba', 'area'] - (
        lakes.loc['SouthernIndian', 'area'] + 
        lakes.loc['Gods', 'area'] + 
        lakes.loc['Cross', 'area']
    )
)
print(diff)

471

Select from the `lakes` Data Frame just Lake Winnipegosis, Island Lake and Playgreen Lake

In [20]:
print(lakes.loc[['Winnipegosis', 'Island', 'Playgreen']])

              area  elevation
Winnipegosis  5374        254
Island        1223        227
Playgreen      657        217

It has been decided that Cross Lake is actually a pond, drop this lake from the Data Frame

In [21]:
lakes = lakes.drop('Cross')
print(lakes)

                 area  elevation
Winnipeg        24387        217
Winnipegosis     5374        254
Manitoba         4624        248
SouthernIndian   2247        254
Cedar            1353        253
Island           1223        227
Gods             1151        178
Playgreen         657        217

New statistics show that due to erosion, the size of Lake Manitoba is now 4750 km<sup>2</sup>.  
Make this change in your Data Frame

In [22]:
lakes.loc['Manitoba', 'area'] = 4750
print(lakes.loc['Manitoba'])

area         4750
elevation     248
Name: Manitoba, dtype: int64

Thanks to some significant tectonic activity, Southern Indian Lake is now at an altitude of 265 m. Make this change in your Data Frame.

In [23]:
lakes.loc['SouthernIndian', 'elevation'] = 265
print(lakes.loc['SouthernIndian'])

area         2247
elevation     265
Name: SouthernIndian, dtype: int64

#### Sugar Data Set
The following data set is the mg weight of sugar from  3 different genetically modified sugar plant, as well as an unmodified (control; con) version of the plant.

In [24]:
sugar = pd.DataFrame({
    'weight': [82, 97.8, 69.9, 58.3, 67.9, 59.3, 68.1, 70.8, 63.6, 50.7, 47.1, 48.9],
    'treatments': ['con', 'con', 'con', 'A', 'A', 'A', 'B', 'B', 'B', 'C', 'C', 'C']
})
print(sugar)

   treatments  weight
0         con    82.0
1         con    97.8
2         con    69.9
3           A    58.3
4           A    67.9
5           A    59.3
6           B    68.1
7           B    70.8
8           B    63.6
9           C    50.7
10          C    47.1
11          C    48.9

First we want to drill in to treatment `B`, select just the the plants that were genetically modified with alteration `B`

In [25]:
print(sugar[sugar['treatments'] == 'B'])

  treatments  weight
6          B    68.1
7          B    70.8
8          B    63.6

We want to find the best performing plants, select just those plants from which more than 65 mg of sugar was extracted

In [26]:
print(sugar[sugar['weight'] > 65])

  treatments  weight
0        con    82.0
1        con    97.8
2        con    69.9
4          A    67.9
6          B    68.1
7          B    70.8

Now we want to compare group `C` to the control (`con`) group, select the plants whose treatment was in the control group or genetically modified with alteration `C`

In [27]:
print(sugar[(sugar['treatments'] == 'C') | (sugar['treatments'] == 'con')])

# Also could use isin(), i.e. sugar[sugar['treatments'].isin(['C', 'con'])]

   treatments  weight
0         con    82.0
1         con    97.8
2         con    69.9
9           C    50.7
10          C    47.1
11          C    48.9

We would like to compare which of the alterations performed best, select all of the plants that are not in the control group

In [28]:
print(sugar[sugar['treatments'] != 'con'])

# Also could use the inverse of isin(), i.e. sugar[~sugar['treatments'].isin(['con'])]

   treatments  weight
3           A    58.3
4           A    67.9
5           A    59.3
6           B    68.1
7           B    70.8
8           B    63.6
9           C    50.7
10          C    47.1
11          C    48.9

#### London Terminal Stations

The data set below describes 9 popular London Terminal stations.

In [29]:
stations = pd.DataFrame({
    'Station': ['Waterloo', 'Victoria', 'Liverpool Street', 'London Bridge', 'Euston', 'Kings Cross', 'Charing Cross'],
    'Opened': [1848, 1862, 1874, 1836, 1837, 1852, 1864],
    'Passengers': [99148338, 81151418, 66556690,  53850938,  41677870, 33361696, 28998152],
    'Operator': ['Network Rail', 'Network Rail', 'Network Rail', 'Network Rail', 'Network Rail', 'Network Rail', 'Network Rail'],
    'Platforms': [22, 19, 18, 15, 18, 12, 6]
    }
)
stations = stations.set_index('Station')
print(stations)

                  Opened      Operator  Passengers  Platforms
Station
Waterloo            1848  Network Rail    99148338         22
Victoria            1862  Network Rail    81151418         19
Liverpool Street    1874  Network Rail    66556690         18
London Bridge       1836  Network Rail    53850938         15
Euston              1837  Network Rail    41677870         18
Kings Cross         1852  Network Rail    33361696         12
Charing Cross       1864  Network Rail    28998152          6

Use the `describe()` method for the `stations` Data Frame to describe the data

In [30]:
stations.describe()

            Opened    Passengers  Platforms
count     7.000000  7.000000e+00   7.000000
mean   1853.285714  5.782073e+07  15.714286
std      14.221044  2.592922e+07   5.313953
min    1836.000000  2.899815e+07   6.000000
25%    1842.500000  3.751978e+07  13.500000
50%    1852.000000  5.385094e+07  18.000000
75%    1863.000000  7.385405e+07  18.500000
max    1874.000000  9.914834e+07  22.000000

What is the total annual passenger figure for stations in the data set that were opened before 1860?

In [31]:
opened_before_1860 = stations[stations['Opened'] < 1860]
annual_passengers_opened_before_1860 = opened_before_1860['Passengers'].sum()
print(annual_passengers_opened_before_1860)

228038842

What is the average opening year for stations with more than 6 million passengers annually?

In [32]:
more_than_6M = stations[stations['Passengers'] > 6000000]
mean_open_year_more_than_6M = more_than_6M['Opened'].mean()
print(int(mean_open_year_more_than_6M))

1853

Sort the Data Frame by the number of platforms each station has.

In [33]:
stations.sort_values('Platforms')

                  Opened      Operator  Passengers  Platforms
Station
Charing Cross       1864  Network Rail    28998152          6
Kings Cross         1852  Network Rail    33361696         12
London Bridge       1836  Network Rail    53850938         15
Liverpool Street    1874  Network Rail    66556690         18
Euston              1837  Network Rail    41677870         18
Victoria            1862  Network Rail    81151418         19
Waterloo            1848  Network Rail    99148338         22

## Section 3 - Vectorised Functions

#### Energy of a Photon

The Data Frame below gives the wavelengths of light in the visible spectrum

In [34]:
light = pd.DataFrame([
    {'colour': 'violet', 'wavelength': 400 * 10 ** -9},
    {'colour': 'blue', 'wavelength': 450 * 10 ** -9},
    {'colour': 'green', 'wavelength': 500 * 10 ** -9},
    {'colour': 'yellow', 'wavelength': 580 * 10 ** -9},
    {'colour': 'orange', 'wavelength': 600 * 10 ** -9},
    {'colour': 'red', 'wavelength': 650 * 10 ** -9},
])
light = light.set_index('colour')
print(light)

          wavelength
colour
violet  4.000000e-07
blue    4.500000e-07
green   5.000000e-07
yellow  5.800000e-07
orange  6.000000e-07
red     6.500000e-07

Assign a new column "`energy_of_photon`" to the Data Frame that is the energy of a photon as calculated by:  

$ E = \dfrac{hc}{\lambda} $  

Where:  
* E is the energy of a photon
* h is the Planck constant
* c is the speed of light
* $ \lambda $ is the wavelength

The speed of light is approximately $3 \times 10^9 m/s$ and the Plank constant is approximately $6.62 \times 10^{-34} Js$

In [35]:
c = 3 * 10 ** 9
h = 6.62 * 10 ** -34
light['energy_of_photon'] = (h * c) / light['wavelength']
print(light)

          wavelength  energy_of_photon
colour
violet  4.000000e-07      4.965000e-18
blue    4.500000e-07      4.413333e-18
green   5.000000e-07      3.972000e-18
yellow  5.800000e-07      3.424138e-18
orange  6.000000e-07      3.310000e-18
red     6.500000e-07      3.055385e-18

It takes 4.18 Joules to heat 1 gram of water by 1 degree Celcius. 

How many photons of red light would be needed to heat 1 gram of water by 1 degree Celcius?

In [36]:
one_calorie_in_joules = 4.18
energy_of_red_photon = light.loc['red', 'energy_of_photon']
red_photons_in_one_calorie = one_calorie_in_joules / energy_of_red_photon

print(red_photons_in_one_calorie)

1.3680765357502518e+18

#### FBI Crime Data Set
The following cell provides FBI data on crime statistics in the USA over 25 years. Run the cell to see the DataFrame

In [37]:
crime = pd.DataFrame([
    {'Population': 262803276, 'Violent_Crimes': 1798792, 'Murders': 21606},
    {'Population': 281421906, 'Violent_Crimes': 1425486, 'Murders': 15586},
    {'Population': 296507061, 'Violent_Crimes': 1390745, 'Murders': 16740},
    {'Population': 309330219, 'Violent_Crimes': 1251248, 'Murders': 14722},
    {'Population': 321444981, 'Violent_Crimes': 1197704, 'Murders': 15696}
], columns=['Population', 'Violent_Crimes', 'Murders'], index=[1995, 2000, 2005, 2010, 2015])
print(crime)

      Population  Violent_Crimes  Murders
1995   262803276         1798792    21606
2000   281421906         1425486    15586
2005   296507061         1390745    16740
2010   309330219         1251248    14722
2015   321444981         1197704    15696

The number of murders went up slightly from 2000 to 2015, but what happened to the murder rate (murders per 100,000 population)?

In [38]:
crime['Murder_Rate'] = crime['Murders'] / (crime['Population'] / 100000)

murder_rate_2010 = crime.loc[2000, 'Murder_Rate']
murder_rate_2015 = crime.loc[2015, 'Murder_Rate']

print("The murder rate went from {} in 2000 to {} in 2015".format(murder_rate_2010, murder_rate_2015))

The murder rate went from 5.53830375948 in 2000 to 4.8829507156 in 2015

Print just the data for the years that the violent crime rate was between 400 and 500 violent crimes per 100,000 citizens

In [39]:
crime['Violent_Crime_Rate'] = crime['Violent_Crimes'] / (crime['Population'] / 100000)

print(crime[(crime['Violent_Crime_Rate'] > 400) & (crime['Violent_Crime_Rate'] < 500)])

      Population  Violent_Crimes  Murders  Murder_Rate  Violent_Crime_Rate
2005   296507061         1390745    16740     5.645734          469.042793
2010   309330219         1251248    14722     4.759315          404.502348

#### Employee Salary Data Set (Mock)

The following is mocked HR data for employees in a large corporation. The employees are assigned a tier based on how long they've been with the company and the level of their position.   

Run the cell below to see the Data Frame.

In [40]:
employees = pd.DataFrame([
    {"name": "Peter Butler", "salary": 87031, "title": "Financial Analyst", "tier": 3}, 
    {"name": "Amanda Wood", "salary": 80277, "title": "Senior Sales Associate", "tier": 1},
    {"name": "Stephanie Stanley", "salary": 72947, "title": "Senior Financial Analyst", "tier": 4}, 
    {"name": "Todd Rice", "salary": 64779, "title": "Web Developer I", "tier": 2}, 
    {"name": "Victor Dixon", "salary": 24377, "title": "Instructor", "tier": 3}, 
    {"name": "Charles Wood", "salary": 79613, "title": "Database Administrator I", "tier": 2}, 
    {"name": "Ryan Moreno", "salary": 95183, "title": "General Manager", "tier": 1},
    {"name": "Edward Cook", "salary": 17525, "title": "Research Assistant III", "tier": 3},
    {"name": "Amanda Stephens", "salary": 69428, "title": "General Manager", "tier": 3}, 
    {"name": "Joseph Green", "salary": 38846, "title": "Recruitment Specialist", "tier": 2},
    {"name": "Stephen Morris", "salary": 221440, "title": "Automation Specialist I", "tier": 1}
])

print(employees)

                 name  salary  tier                     title
0        Peter Butler   87031     3         Financial Analyst
1         Amanda Wood   80277     1    Senior Sales Associate
2   Stephanie Stanley   72947     4  Senior Financial Analyst
3           Todd Rice   64779     2           Web Developer I
4        Victor Dixon   24377     3                Instructor
5        Charles Wood   79613     2  Database Administrator I
6         Ryan Moreno   95183     1           General Manager
7         Edward Cook   17525     3    Research Assistant III
8     Amanda Stephens   69428     3           General Manager
9        Joseph Green   38846     2    Recruitment Specialist
10     Stephen Morris  221440     1   Automation Specialist I

The company is doing well and has decided that each employee will get a one-off bonus based on their salary and tier as follows:
* Tier 1 employees get 10% of their salary, up to a maximum of £7500
* Tier 2 employees get 7.5% of their salary, up to a maximum of £7500
* Tier 3 employees get 5% of their salary, or £1500, whichever is greater
* Tier 4 employees get 5% of their salary, or £1000, whichever is greater

Write a function and apply the function to the Data Frame to calculate the bonuses for each employee

In [41]:
# Apply row-wise, this is fine on such a small dataframe

def bonus_apply_to_row(row):
    if row['tier'] == 1:
        bonus = min(7500, row['salary'] * 0.1)
    elif row['tier'] == 2:
        bonus = min(7500, row['salary'] * 0.075)
    elif row['tier'] == 3:
        bonus = max(1500, row['salary'] * 0.05)
    elif row['tier'] == 4:
        bonus = max(1000, row['salary'] * 0.05)
    bonus = round(bonus, 2)
    return bonus

employees['Bonus'] = employees.apply(bonus_apply_to_row, axis=1)
print(employees)

                 name  salary  tier                     title    Bonus
0        Peter Butler   87031     3         Financial Analyst  4351.55
1         Amanda Wood   80277     1    Senior Sales Associate  7500.00
2   Stephanie Stanley   72947     4  Senior Financial Analyst  3647.35
3           Todd Rice   64779     2           Web Developer I  4858.43
4        Victor Dixon   24377     3                Instructor  1500.00
5        Charles Wood   79613     2  Database Administrator I  5970.97
6         Ryan Moreno   95183     1           General Manager  7500.00
7         Edward Cook   17525     3    Research Assistant III  1500.00
8     Amanda Stephens   69428     3           General Manager  3471.40
9        Joseph Green   38846     2    Recruitment Specialist  2913.45
10     Stephen Morris  221440     1   Automation Specialist I  7500.00

#### Premier League 2015/16

The data set below is the final league table of the Premier League for 2015/16, Leicester's famous league winning season.

Run the cell below to see the league table

In [42]:
prem = pd.DataFrame([
    {'D': 9,'GA': 67, 'GF': 45, 'L': 18, 'Pld': 38, 'Team': 'AFC Bournemouth', 'W': 11}, 
    {'D': 11, 'GA': 36, 'GF': 65, 'L': 7, 'Pld': 38, 'Team': 'Arsenal', 'W': 20}, 
    {'D': 8, 'GA': 76, 'GF': 27, 'L': 27, 'Pld': 38, 'Team': 'Aston Villa', 'W': 3}, 
    {'D': 14, 'GA': 53, 'GF': 59, 'L': 12, 'Pld': 38, 'Team': 'Chelsea', 'W': 12}, 
    {'D': 9, 'GA': 51, 'GF': 39, 'L': 18, 'Pld': 38, 'Team': 'Crystal Palace', 'W': 11}, 
    {'D': 14, 'GA': 55, 'GF': 59, 'L': 13, 'Pld': 38, 'Team': 'Everton', 'W': 11}, 
    {'D': 12, 'GA': 36, 'GF': 68, 'L': 3, 'Pld': 38, 'Team': 'Leicester City', 'W': 23}, 
    {'D': 12, 'GA': 50, 'GF': 63, 'L': 10, 'Pld': 38, 'Team': 'Liverpool', 'W': 16}, 
    {'D': 9, 'GA': 41, 'GF': 71, 'L': 10, 'Pld': 38, 'Team': 'Manchester City', 'W': 19}, 
    {'D': 9, 'GA': 35, 'GF': 49, 'L': 10, 'Pld': 38, 'Team': 'Manchester United', 'W': 19}, 
    {'D': 10, 'GA': 65, 'GF': 44, 'L': 19, 'Pld': 38, 'Team': 'Newcastle United', 'W': 9}, 
    {'D': 7, 'GA': 67, 'GF': 39, 'L': 22, 'Pld': 38, 'Team': 'Norwich City', 'W': 9}, 
    {'D': 9, 'GA': 41, 'GF': 59, 'L': 11, 'Pld': 38, 'Team': 'Southampton', 'W': 18}, 
    {'D': 9, 'GA': 55, 'GF': 41, 'L': 15, 'Pld': 38, 'Team': 'Stoke City', 'W': 14}, 
    {'D': 12, 'GA': 62, 'GF': 48, 'L': 17, 'Pld': 38, 'Team': 'Sunderland', 'W': 9}, 
    {'D': 11, 'GA': 52, 'GF': 42, 'L': 15, 'Pld': 38, 'Team': 'Swansea City', 'W': 12}, 
    {'D': 13, 'GA': 35, 'GF': 69, 'L': 6, 'Pld': 38, 'Team': 'Tottenham Hotspur', 'W': 19}, 
    {'D': 9, 'GA': 50, 'GF': 40, 'L': 17, 'Pld': 38, 'Team': 'Watford', 'W': 12}, 
    {'D': 13, 'GA': 48, 'GF': 34, 'L': 15, 'Pld': 38, 'Team': 'West Bromwich Albion', 'W': 10}, 
    {'D': 14, 'GA': 51, 'GF': 65, 'L': 8, 'Pld': 38, 'Team': 'West Ham United', 'W': 16}
], columns = ['Team', 'Pld', 'W', 'D', 'L', 'GF', 'GA'])
print(prem)

                    Team  Pld   W   D   L  GF  GA
0        AFC Bournemouth   38  11   9  18  45  67
1                Arsenal   38  20  11   7  65  36
2            Aston Villa   38   3   8  27  27  76
3                Chelsea   38  12  14  12  59  53
4         Crystal Palace   38  11   9  18  39  51
5                Everton   38  11  14  13  59  55
6         Leicester City   38  23  12   3  68  36
7              Liverpool   38  16  12  10  63  50
8        Manchester City   38  19   9  10  71  41
9      Manchester United   38  19   9  10  49  35
10      Newcastle United   38   9  10  19  44  65
11          Norwich City   38   9   7  22  39  67
12           Southampton   38  18   9  11  59  41
13            Stoke City   38  14   9  15  41  55
14            Sunderland   38   9  12  17  48  62
15          Swansea City   38  12  11  15  42  52
16     Tottenham Hotspur   38  19  13   6  69  35
17               Watford   38  12   9  17  40  50
18  West Bromwich Albion   38  10  13  15  34  48
19       West Ham United   38  16  14   8  65  51

Notice that the data is, however, in alphabetical order by team name.

You must order the league table by the number of points, then by the goal difference, to show how the final table looked.

The goal difference is the difference between the number of goals scored and the number of goals conceded.
The number of points is as follows:
* 3 points for a win
* 1 point for a draw
* 0 points for a loss

In [43]:
prem['Points'] = prem['W'] * 3 + prem['D']
prem['GD'] = prem['GF'] - prem['GA']
prem = prem.sort_values(['Points', 'GD'], ascending=False)
prem['POS'] = np.arange(1, 21)
prem = prem.set_index('POS')
prem

                     Team  Pld   W   D   L  GF  GA  Points  GD
POS
1          Leicester City   38  23  12   3  68  36      81  32
2                 Arsenal   38  20  11   7  65  36      71  29
3       Tottenham Hotspur   38  19  13   6  69  35      70  34
4         Manchester City   38  19   9  10  71  41      66  30
5       Manchester United   38  19   9  10  49  35      66  14
6             Southampton   38  18   9  11  59  41      63  18
7         West Ham United   38  16  14   8  65  51      62  14
8               Liverpool   38  16  12  10  63  50      60  13
9              Stoke City   38  14   9  15  41  55      51 -14
10                Chelsea   38  12  14  12  59  53      50   6
11                Everton   38  11  14  13  59  55      47   4
12           Swansea City   38  12  11  15  42  52      47 -10
13                Watford   38  12   9  17  40  50      45 -10
14   West Bromwich Albion   38  10  13  15  34  48      43 -14
15         Crystal Palace   38  11   9  18  39  51      42 -12
16        AFC Bournemouth   38  11   9  18  45  67      42 -22
17             Sunderland   38   9  12  17  48  62      39 -14
18       Newcastle United   38   9  10  19  44  65      37 -21
19           Norwich City   38   9   7  22  39  67      34 -28
20            Aston Villa   38   3   8  27  27  76      17 -49

# Section 4 - Cleaning, Transforming and Merging Data

#### Used Car Dealership (Mocked Data)

A used car dealership sells Toyotas and Fords.  

They keep the details of the cars and the prices these cars sold for in two separate files:
* data/car_details.csv
* data/car_prices.csv

Load the car details and car prices csvs as two separate Data Frames

In [44]:
car_details = pd.read_csv('data/car_details.csv')
car_prices = pd.read_csv('data/car_prices.csv')

Using `.head()`, what does each of these Data Frames look like?

In [45]:
print(car_details.head())
print('')
print(car_prices.head())

  Number_Plate    Make    Model  Year
0     HO07 TWC  Toyota     RAV4  2007
1     YW59 CBS    Ford  Mustang  2009
2     HJ56 DKV    Ford  Mustang  2006
3     HT65 KGK    Ford    Focus  2015
4     FO10 WUY  Toyota     gt86  2010

  Number_Plate  Price
0     HO07 TWC   8051
1     YW59 CBS  15113
2     HJ56 DKV   8078
3     HT65 KGK  17552
4     FO10 WUY  13678

What is the average price paid for a Ford Mustang?

In [46]:
car_df = pd.merge(car_details, car_prices, on='Number_Plate')

mustangs = car_df[(car_df['Make'] == 'Ford') & (car_df['Model'] == 'Mustang')]
average_mustang = mustangs['Price'].mean()
print("The average Ford Mustang price is £{}".format(round(average_mustang, 2)))

The average Ford Mustang price is £17838.64

What is the average price paid for a 2006 Toyota RAV4?

In [47]:
mask = ((car_df['Make'] == 'Toyota') & (car_df['Model'] == 'RAV4') & (car_df['Year'] == 2006))
rav4_2006 = car_df[mask]
av_rav4_2006_price = rav4_2006['Price'].mean()

print("The average price paid for a 2006 Toyota RAV 4 is £{}".format(round(av_rav4_2006_price, 2)))

The average price paid for a 2006 Toyota RAV 4 is £6190.0

What is the minimum price paid for a car built in 2007? What is the make and model of this car?

In [48]:
cars_2007 = car_df[car_df['Year'] == 2007]
cars_2007 = cars_2007.sort_values('Price')
cheapest_car_2007 = cars_2007.iloc[0]

print("The minimum price for a car built in 2007 is {}".format(cheapest_car_2007['Price']))
print("This car is a {} {}".format(cheapest_car_2007['Make'], cheapest_car_2007['Model']))

The minimum price for a car built in 2007 is 3498
This car is a Toyota Yaris

A man comes in looking for a Ford Mustang, but only has £20,000 to spend.   

Looking at the historical data, what year of Ford Mustang can this man afford?

In [49]:
mustangs_under_20k = mustangs[mustangs['Price'] < 20000]
mustangs_under_20k = mustangs_under_20k.sort_values('Price', ascending=False)
print(mustangs_under_20k.head())
print("Given Historical data, the newest car this man can afford is from the year 2011")

    Number_Plate  Make    Model  Year  Price
663     RP61 YMU  Ford  Mustang  2011  19736
173     VO11 ULA  Ford  Mustang  2011  19418
378     OJ11 TGR  Ford  Mustang  2011  19271
492     DV11 MKO  Ford  Mustang  2011  19235
208     WP11 GGS  Ford  Mustang  2011  19114
Given Historical data, the newest car this man can afford is from the year 2011

A family are looking to buy either a Ford Focus or Toyota Verso, they don't have a preference between the two, but the oldest they would want to buy is 2013. Which car would cost them more money?

In [50]:
focus_mask = ((car_df['Make'] == 'Ford') & (car_df['Model'] == 'Focus') & (car_df['Year'] >= 2013))
verso_mask = ((car_df['Make'] == 'Toyota') & (car_df['Model'] == 'Verso') & (car_df['Year'] >= 2013))
av_focus_price = car_df[focus_mask]['Price'].mean()
av_verso_price = car_df[verso_mask]['Price'].mean()

if av_focus_price > av_verso_price:
    print("A Focus is more expensive on average than a Verso")
else:
    print("A Verso is more expensive on average than a Focus")

A Focus is more expensive on average than a Verso

What year of car has the dealership sold the most of?

In [51]:
print(car_df['Year'].value_counts())

print("The dealership sold 92 cars in 2015 and 2008")

2015    92
2008    92
2013    89
2010    88
2006    84
2011    83
2009    83
2007    83
2005    83
2012    79
2014    74
2016    70
Name: Year, dtype: int64
The dealership sold 92 cars in 2015 and 2008

#### Pokemon Dataset

There is a dataset with pokemon in it stored in `data/pokemon.csv`

Load this dataset and view the top 10 rows using the method `.head(10)`

In [52]:
df = pd.read_csv('data/pokemon.csv')
df.head(10)

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,NaN,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80.0,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100.0,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120.0,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50.0,65,1,False
5,5,Charmeleon,Fire,NaN,58,64,58,80,65.0,80,1,False
6,6,Charizard,Fire,Flying,78,84,78,109,85.0,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,78,130,111,130,85.0,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,78,104,78,159,115.0,100,1,False
9,7,Squirtle,Water,NaN,44,48,65,50,64.0,43,1,False

Notice that some Pokemon have variants with the same Pokedex number (`'#'`), we will count these as duplicates, remove these duplicates, only keeping the first instance of each pokemon.

In [53]:
df = df.drop_duplicates(subset='#', keep='first')

Some of the `Sp. Def` statistics are missing. For those missing `Sp. Def`, assume that the value is the same as `Sp. Atk` and fill the missing values with the values from `Sp. Atk`.

In [54]:
df['Sp. Def'] = df['Sp. Def'].fillna(df['Sp. Atk'])

Create a new column `Total` with the sum of the columns `HP`, `Attack`, `Defense`, `Sp. Atk`, `Sp. Def` and `Speed`

In [55]:
df['Total'] = sum([df['HP'], df['Attack'], df['Defense'], df['Sp. Atk'], df['Sp. Def'], df['Speed']])

Which Pokemon from Generation 1 is the most powerful in terms of total stats?

In [56]:
df.sort_values('Total', ascending=False).head(1)

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Total
552,493,Arceus,Normal,NaN,120,120,120,120,120.0,120,4,True,720.0

Which pokemon makes the best punching bag (HP + Defence + Sp. Def)?

In [57]:
df.loc[(df['HP'] + df['Defense'] + df['Sp. Def']).sort_values(ascending=False).index[0]]

#                 213
Name          Shuckle
Type 1            Bug
Type 2           Rock
HP                 20
Attack             10
Defense           230
Sp. Atk            10
Sp. Def           230
Speed               5
Generation          2
Legendary       False
Total             505
Name: 230, dtype: object

#### NHS England Admission Data

There are two datasets for NHS England Admission Data
* data/ae_2014.csv
* data/ae_2013.csv

Load these two data sets into Data Frames and concatenate the Data Frames into one Data Frame

In [58]:
df1 = pd.read_csv('data/ae_2014.csv')
df2 = pd.read_csv('data/ae_2013.csv')
df = pd.concat([df1, df2])

`Total Attendence > 4 hours` is the number of patients that had to wait >4 hours from arrival to admission.  

What is the average percentage of patients that had to wait >4 hours for admission?

In [59]:
df['Total Attendance'] = df['Total Attendance'].map(lambda x: int(x.replace(',', '')))
df['Total Attendence > 4 hours'] = df['Total Attendence > 4 hours'].map(lambda x: int(x.replace(',', '')))
df.head()

             Date  Total Attendance  Total Attendence > 4 hours
0  W/E 05/01/2014            387463                       22113
1  W/E 12/01/2014            383566                       21083
2  W/E 19/01/2014            390532                       17779
3  W/E 26/01/2014            398018                       15588
4  W/E 02/02/2014            406929                       19251

The target for admission in less than 4 hours for the NHS is 95%.

How many weeks in 2013 and 2014, respectively, did they not meet this target?

In [60]:
def get_year(week_str):
    year = int(week_str[-4:])
    return year

df['Year'] = df['Date'].map(get_year)
df['Target_Not_Met'] = (df['Total Attendence > 4 hours'] / df['Total Attendance']) > 0.05
print(len(df[(df['Target_Not_Met'] == True) & (df['Year'] == 2013)]))
print(len(df[(df['Target_Not_Met'] == True) & (df['Year'] == 2014)]))

17
30

# Section 5 - Exercises

### Vector Magnitudes

The magnitude of a vector is the square root of the sum of squares of a vector, i.e. the magnitude of the vector a below is:

$$
\bar{a} = \begin{bmatrix} x \\ y \\ z \end{bmatrix}
$$


$ |\bar{a}| = \sqrt{x^2 + y^2 + z^2} $

Add a column to the following DataFrame called `magnitude` that is the magnitude of each of the vectors a-j. 

Round this column to 2 decimal places.

In [61]:
# Run this cell first
vectors = pd.DataFrame({
    'x': [1, 3, -3, 4, 8, -7, 10, -2, -5, 9],
    'y': [-1, 13, 0, -2, 4, 6, 7, 19, 3, 12],
    'z': [3, 4, 7, 4, 2, -5, 0, 12, 8, -6]
}, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [62]:
# Write your code here
vectors['magnitude'] = np.sqrt((vectors['x'] ** 2) + (vectors['y'] ** 2) + (vectors['z'] ** 2))
vectors['magnitude'] = np.round(vectors['magnitude'], 2)

In [63]:
# Now test your function
test_1 = 'magnitude' in vectors.columns
test_2 = vectors.loc['a', 'magnitude'] == 3.32
test_3 = vectors.loc['h', 'magnitude'] == 22.56
test_4 = vectors.loc['i', 'magnitude'] == 9.90
test_5 = vectors.loc['c', 'magnitude'] == 7.62
test_6 = vectors.loc['d', 'magnitude'] == 6.00

if all([test_1, test_2, test_3, test_4, test_5, test_6]):
    print("PASSED")
else:
    print("FAILED")

PASSED

### Calculating $R^2$

The $R^2$ statistic is a common method of measuring how well a regression model performs at predicting outcomes.  

$R^2$ is the proportion of the variance in data explained by the model, given a number of independent variable inputs.

$ y $ is the observed (actual) output y

$ \hat{y} $ is our prediction of the output y

$ \bar{y} $ is the mean of the observed output y

The total sum of squares (TSS) is defined as follows:

$TSS = \Sigma^n_i (y_i - \bar{y_i})^2 $

The residual sum of squares (RSS), also known as the sum of squared error, is defined as follows:

$RSS = \Sigma^n_i (y_i - \hat{y_i})^2 $

$R^2$ is then calculated as:

$R^2 = 1 - \dfrac{RSS}{TSS} $

Calculate the $R^2$ value from the Data Frame below and store it in a variable `r_squared`

In [64]:
# Run this cell first

df = pd.DataFrame({
    'y_predicted': [220, 165, 140, 130, 160, 178, 200, 123, 130, 140, 162, 157],
    'y_observed': [195, 160, 120, 155, 161, 180, 185, 123, 128, 160, 180, 182]
})

In [65]:
# Write your code here
tss = np.sum((df['y_observed'] - np.mean(df['y_observed'])) ** 2)
rss = np.sum((df['y_observed'] - df['y_predicted']) ** 2)
r_squared = 1 - (rss / tss)
r_squared

0.544096554136785

In [66]:
# Now test your function

test_1 = round(r_squared, 2) == 0.54

if test_1:
    print("PASSED")
else:
    print("FAILED")

PASSED

`pd.read_html()` will return a list of tables on an html page.  
The documentation for this can be found at http://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_html.html

Download the table at https://simple.wikipedia.org/wiki/List_of_U.S._states   

Then use pandas to take in this data, find how many states there are.

In [67]:
states = pd.read_html('https://simple.wikipedia.org/wiki/List_of_U.S._states', header=0)
states = states[0]
print(states.head())
print("There are {} states".format(len(states)))

   Sl no. Abbreviations  State Name      Capital     Became a State
0       1            AL     Alabama   Montgomery  December 14, 1819
1       2            AK      Alaska       Juneau    January 3, 1959
2       3            AZ     Arizona      Phoenix  February 14, 1912
3       4            AR    Arkansas  Little Rock      June 15, 1836
4       5            CA  California   Sacramento  September 9, 1850
There are 50 states

Now sort by the date they became a state and display just the oldest 5 states.

Remember you'll have to parse the dates given as strings

In [68]:
import datetime

def convert_to_date(dt_str):
    dt = datetime.datetime.strptime(dt_str, '%B %d, %Y')
    dt = dt.date()
    return dt

states['Became a State'] = states['Became a State'].map(convert_to_date)
states.sort_values('Became a State').head()

    Sl no. Abbreviations    State Name     Capital Became a State
7        8            DE      Delaware       Dover     1787-12-07
37      38            PA  Pennsylvania  Harrisburg     1787-12-12
29      30            NJ    New Jersey     Trenton     1787-12-18
9       10            GA       Georgia     Atlanta     1788-01-02
6        7            CT   Connecticut    Hartford     1788-01-09

How many states have a capital city starting with the letter "O"?

In [69]:
def starts_with_o(capital):
    return capital.startswith('O')

len(states[states['Capital'].map(starts_with_o)])

2